#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [30s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [40s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [20s elapsed]
Error: a Certificate named "vehicles-ipatente-io-pagopa-it" was not found in Key Vault at URI "https://io-p-kv.vault.azure.net/"

  with module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io,
  on ../_modules/application_gateway/data.tf line 123, in data "azurerm_key_vault_certificate" "app_gw_vehicles_ipatente_io":
 123: data "azurerm_key_vault_certificate" "app_gw_vehicles_ipatente_io" {


Error: a Certificate named "licences-ipatente-io-pagopa-it" was not found in Key Vault at URI "https://io-p-kv.vault.azure.net/"

  with module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io,
  on ../_modules/application_gateway/data.tf line 128, in data "azurerm_key_vault_certificate" "app_gw_licences_ipatente_io":
 128: data "azurerm_key_vault_certificate" "app_gw_licences_ipatente_io" {

id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-session-manager-rg-01/providers/Microsoft.Web/sites/io-p-weu-session-manager-app-04]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [50s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [30s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [1m0s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [40s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [1m10s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [50s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [1m20s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [1m0s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [1m30s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [1m10s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_vehicles_ipatente_io: Still reading... [1m40s elapsed]
module.application_gateway_weu.data.azurerm_key_vault_certificate.app_gw_licences_ipatente_io: Still reading... [1m20s elapsed]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.apim_itn.module.apim_v2.azurerm_api_management_logger.this[0] has been deleted
  - resource "azurerm_api_management_logger" "this" {
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/loggers/io-p-itn-apim-01-logger" -> null
        name                = "io-p-itn-apim-01-logger"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management_diagnostic.this[0] will be updated in-place
  ~ resource "azurerm_api_management_diagnostic" "this" {
      ~ api_management_logger_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/loggers/io-p-apim-v2-api-logger" -> (known after apply)
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/diagnostics/applicationinsights"
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management_logger.this[0] will be created
  + resource "azurerm_api_management_logger" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "io-p-itn-apim-01-logger"
      + resource_group_name = "io-p-itn-common-rg-01"

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # module.global.module.dns.azurerm_dns_a_record.ipatente_io_pagopa_it will be destroyed
  # (because azurerm_dns_a_record.ipatente_io_pagopa_it is not in configuration)
  - resource "azurerm_dns_a_record" "ipatente_io_pagopa_it" {
      - fqdn                = "ipatente.io.pagopa.it." -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/io.pagopa.it/A/ipatente" -> null
      - name                = "ipatente" -> null
      - records             = [
          - "20.56.186.217",
        ] -> null
      - resource_group_name = "io-p-rg-external" -> null
      - tags                = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra"
        } -> null
      - ttl                 = 3600 -> null
      - zone_name           = "io.pagopa.it" -> null
        # (1 unchanged attribute hidden)
    }

  # module.global.module.dns.azurerm_dns_a_record.licences_ipatente_io_pagopa_it will be created
  + resource "azurerm_dns_a_record" "licences_ipatente_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "licences"
      + records             = [
          + "20.56.186.217",
        ]
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra"
        }
      + ttl                 = 3600
      + zone_name           = "ipatente.io.pagopa.it"
    }

  # module.global.module.dns.azurerm_dns_a_record.vehicles_ipatente_io_pagopa_it will be created
  + resource "azurerm_dns_a_record" "vehicles_ipatente_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vehicles"
      + records             = [
          + "20.56.186.217",
        ]
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra"
        }
      + ttl                 = 3600
      + zone_name           = "ipatente.io.pagopa.it"
    }

Plan: 3 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 62, in resource "azurerm_web_application_firewall_policy" "api_app":
  62:         disabled_rules = [
  63:           "942100",
  64:           "942120",
  65:           "942190",
  66:           "942200",
  67:           "942210",
  68:           "942240",
  69:           "942250",
  70:           "942260",
  71:           "942330",
  72:           "942340",
  73:           "942370",
  74:           "942380",
  75:           "942430",
  76:           "942440",
  77:           "942450",
  78:         ]

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 53 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
